Revit 2027 API
IFCParameterTemplate.AddPropertyMappingInfo Method
 Adds a property mapping info to the property set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddPropertyMappingInfo(
	PropertySetupType propertySetupType,
	string propertySetName,
	IFCPropertyMappingInfo propertyMappingInfo
)
Public Sub AddPropertyMappingInfo (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	propertyMappingInfo As IFCPropertyMappingInfo
)
public:
void AddPropertyMappingInfo(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	IFCPropertyMappingInfo^ propertyMappingInfo
)
member AddPropertyMappingInfo :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        propertyMappingInfo : IFCPropertyMappingInfo -> unit
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
propertyMappingInfo IFCPropertyMappingInfo
 The property mapping info.
Exceptions
Exception | Condition
ArgumentException |  The mapping info is invalid. -or- A property set with the given name is not present in the template.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace